# ─── Taps ─────────────────────────────────────────────
tap "homebrew/bundle"
tap "oven-sh/bun"

# ─── CLI Tools & Shells ───────────────────────────────
brew "fish"                # User-friendly command-line shell for UNIX-like systems
brew "git"                 # Distributed revision control system
brew "awscli"              # Official Amazon AWS command-line interface
brew "aws-cdk"             # AWS Cloud Development Kit - define infra as code
brew "cocoapods"           # Dependency manager for Cocoa projects
brew "oven-sh/bun/bun"     # Bun - fast JS runtime, bundler, transpiler, package manager

# ─── Development & Infrastructure ─────────────────────
brew "colima"              # Container runtimes on macOS with minimal setup
brew "docker"              # Pack, ship and run applications as containers
brew "docker-compose"      # Isolated development environments using Docker
brew "ollama"              # Create, run, and share large language models locally

# ─── Media & Utilities ────────────────────────────────
brew "ffmpeg"              # Play, record, convert, and stream audio and video

# ─── Desktop Applications - Development Tools ─────────
cask "visual-studio-code"  # Open-source code editor
cask "jetbrains-toolbox"   # JetBrains tools manager
cask "postman"             # API testing and collaboration platform
cask "sourcetree"          # Graphical Git client
cask "cursor"              # AI-powered code editor
cask "chatgpt"             # OpenAI's official ChatGPT desktop app
cask "thonny"              # Python IDE for beginners

# ─── Desktop Applications - Creative & Design ─────────
cask "figma"               # Collaborative interface design tool
cask "ultimaker-cura"      # 3D printing slicer software
cask "obs"                 # Open-source screen recorder & streamer

# ─── Desktop Applications - Productivity & Utilities ─
cask "rectangle"           # Window snapping and resizing tool
cask "1password"           # Secure password manager
cask "1password-cli"       # Command-line interface for 1Password
cask "logi-options+"       # Software for Logitech devices
cask "mos"                 # Smooth scrolling and scroll direction control
cask "stats"               # System monitor for the menu bar

# ─── Desktop Applications - Browsers & Media ─────────
cask "google-chrome"       # Web browser
cask "spotify"             # Music streaming service

# ─── Desktop Applications - Communication ─────────────
cask "telegram"            # Secure messaging app
cask "whatsapp"            # WhatsApp desktop client

# ─── VSCode Extensions ────────────────────────────────
vscode "mechatroner.rainbow-csv" # Highlight and colorize CSV files
